package jmna.loacalc.calculator.hone;

public enum T4ArmorHone {
    HEAD_10("머리 방어구", 10, 0, 0, 0, 0),
    HEAD_11("머리 방어구", 11, 1356, 108, 96, 107),
    HEAD_12("머리 방어구", 12, 1401, 109, 98, 109),
    HEAD_13("머리 방어구", 13, 1513, 116, 104, 116),
    HEAD_14("머리 방어구", 14, 1565, 119, 106, 117),
    HEAD_15("머리 방어구", 15, 1620, 120, 108, 120),
    HEAD_16("머리 방어구", 16, 1676, 123, 110, 122),
    HEAD_17("머리 방어구", 17, 1736, 125, 111, 124),
    HEAD_18("머리 방어구", 18, 1796, 127, 114, 126),
    HEAD_19("머리 방어구", 19, 1859, 129, 115, 128),
    HEAD_20("머리 방어구", 20, 1924, 132, 117, 130),
    HEAD_21("머리 방어구", 21, 1991, 134, 120, 133),
    HEAD_22("머리 방어구", 22, 2061, 136, 121, 135),
    HEAD_23("머리 방어구", 23, 2133, 139, 124, 138),
    HEAD_24("머리 방어구", 24, 2208, 142, 126, 139),
    HEAD_25("머리 방어구", 25, 2285, 144, 128, 142),
    SHOULDER_10("어깨 방어구", 10, 0, 0, 0, 0),
    SHOULDER_11("어깨 방어구", 11, 1444, 93, 107, 96),
    SHOULDER_12("어깨 방어구", 12, 1491, 95, 109, 98),
    SHOULDER_13("어깨 방어구", 13, 1610, 101, 116, 104),
    SHOULDER_14("어깨 방어구", 14, 1666, 102, 117, 106),
    SHOULDER_15("어깨 방어구", 15, 1724, 104, 120, 108),
    SHOULDER_16("어깨 방어구", 16, 1784, 107, 122, 110),
    SHOULDER_17("어깨 방어구", 17, 1847, 108, 124, 111),
    SHOULDER_18("어깨 방어구", 18, 1912, 110, 126, 114),
    SHOULDER_19("어깨 방어구", 19, 1978, 112, 128, 115),
    SHOULDER_20("어깨 방어구", 20, 2048, 114, 130, 117),
    SHOULDER_21("어깨 방어구", 21, 2119, 117, 133, 120),
    SHOULDER_22("어깨 방어구", 22, 2194, 118, 135, 121),
    SHOULDER_23("어깨 방어구", 23, 2270, 120, 138, 124),
    SHOULDER_24("어깨 방어구", 24, 2350, 123, 139, 126),
    SHOULDER_25("어깨 방어구", 25, 2432, 125, 142, 128),
    CHEST_10("상의 방어구", 10, 0, 0, 0, 0),
    CHEST_11("상의 방어구", 11, 1085, 143, 128, 118),
    CHEST_12("상의 방어구", 12, 1121, 146, 131, 120),
    CHEST_13("상의 방어구", 13, 1210, 155, 139, 127),
    CHEST_14("상의 방어구", 14, 1252, 158, 141, 129),
    CHEST_15("상의 방어구", 15, 1296, 161, 144, 132),
    CHEST_16("상의 방어구", 16, 1342, 163, 146, 134),
    CHEST_17("상의 방어구", 17, 1388, 167, 149, 136),
    CHEST_18("상의 방어구", 18, 1437, 169, 151, 139),
    CHEST_19("상의 방어구", 19, 1487, 173, 154, 141),
    CHEST_20("상의 방어구", 20, 1539, 175, 156, 143),
    CHEST_21("상의 방어구", 21, 1593, 179, 160, 146),
    CHEST_22("상의 방어구", 22, 1649, 182, 162, 149),
    CHEST_23("상의 방어구", 23, 1707, 185, 165, 151),
    CHEST_24("상의 방어구", 24, 1766, 189, 167, 154),
    CHEST_25("상의 방어구", 25, 1828, 192, 171, 156),

    ;

    private final String partName;
    private final int lvl;
    private final int mainStat; // 주 능력치
    private final int vitality; // 체력
    private final int phyDef; // 물리 방어력
    private final int magDef; // 마법 방어력

    T4ArmorHone(String partName, int lvl, int mainStat, int vitality, int phyDef, int magDef) {
        this.partName = partName;
        this.lvl = lvl;
        this.mainStat = mainStat;
        this.vitality = vitality;
        this.phyDef = phyDef;
        this.magDef = magDef;
    }
}
